OpenDTEF-v1812/tutorials/compressible/rhoPimpleFoam/RAS/TJunction/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        gamma           1.2;

        p0              table
        (
            (0 1e5)
            (1 1.4e5)
        );
    }

    outlet1
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet2
    {
        type            fixedValue;
        value           $internalField;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
